Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/api/vm/ab-compute.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /compute
Document Length:        29 bytes

Concurrency Level:      10
Time taken for tests:   49.788 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      173000 bytes
HTML transferred:       29000 bytes
Requests per second:    20.09 [#/sec] (mean)
Time per request:       497.878 [ms] (mean)
Time per request:       49.788 [ms] (mean, across all concurrent requests)
Transfer rate:          3.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       6
Processing:    59  496 100.0    496     888
Waiting:       58  476 109.7    490     885
Total:         59  496 100.0    496     888

Percentage of the requests served within a certain time (ms)
  50%    496
  66%    511
  75%    540
  80%    565
  90%    606
  95%    639
  98%    709
  99%    762
 100%    888 (longest request)