Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/api/vm/ab-health.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /health
Document Length:        20 bytes

Concurrency Level:      100
Time taken for tests:   3.504 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1640000 bytes
HTML transferred:       200000 bytes
Requests per second:    2853.93 [#/sec] (mean)
Time per request:       35.039 [ms] (mean)
Time per request:       0.350 [ms] (mean, across all concurrent requests)
Transfer rate:          457.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       7
Processing:    21   35   7.9     32      75
Waiting:       14   31   7.3     28      69
Total:         22   35   7.8     32      75

Percentage of the requests served within a certain time (ms)
  50%     32
  66%     35
  75%     37
  80%     39
  90%     44
  95%     50
  98%     62
  99%     66
 100%     75 (longest request)